MikroElektronika/core_packages/ARM/gcc_clang/def/mindmotion/MM32W373PFB/mcu.h
/** @addtogroup Exported_types
* @{
*/

/*!< MM32W3xxB Standard Peripheral Library old types (maintained for legacy prupose) */
typedef int32_t  s32;
typedef int16_t s16;
typedef int8_t  s8;

typedef const int32_t sc32;  /*!< Read Only */
typedef const int16_t sc16;  /*!< Read Only */
typedef const int8_t sc8;   /*!< Read Only */

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;  /*!< Read Only */
typedef __I int16_t vsc16;  /*!< Read Only */
typedef __I int8_t vsc8;   /*!< Read Only */

typedef uint32_t  u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  /*!< Read Only */
typedef const uint16_t uc16;  /*!< Read Only */
typedef const uint8_t uc8;   /*!< Read Only */

typedef __IO uint32_t  vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;  /*!< Read Only */
typedef __I uint16_t vuc16;  /*!< Read Only */
typedef __I uint8_t vuc8;   /*!< Read Only */

typedef enum {FALSE = 0, TRUE = !FALSE} bool;

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/**
* @}
*/

typedef struct {
    __IO uint32_t     SHCSR;  //0XE000DE24
    __IO uint8_t      MFSR;   //0XE000DE28
    __IO uint8_t      BFSR;   //0XE000DE29
    __IO uint16_t     UFSR;   //0XE000DE2A
    __IO uint32_t     HFSR;   //0XE000DE2C
    __IO uint32_t     DFSR;   //0XE000DE30
    __IO uint32_t     MMAR;   //0XE000DE34
    __IO uint32_t     BFAR;   //0XE000DE38
} HARD_FAULT_TypeDef;


/** @addtogroup Peripheral_registers_structures
* @{
*/

/**
* @brief Analog to Digital Converter
*/

typedef struct {
    __IO uint32_t ADDATA;
    __IO uint32_t ADCFG;
    __IO uint32_t ADCR;
    __IO uint32_t ADCHS;
    __IO uint32_t ADCMPR;
    __IO uint32_t ADSTA;
    __IO uint32_t ADDR0;
    __IO uint32_t ADDR1;
    __IO uint32_t ADDR2;
    __IO uint32_t ADDR3;
    __IO uint32_t ADDR4;
    __IO uint32_t ADDR5;
    __IO uint32_t ADDR6;
    __IO uint32_t ADDR7;
    __IO uint32_t ADDR8;
} ADC_TypeDef;

/**
* @brief Backup Registers
*/

typedef struct {
    uint32_t  RESERVED0;
    __IO uint16_t DR1;
    uint16_t  RESERVED1;
    __IO uint16_t DR2;
    uint16_t  RESERVED2;
    __IO uint16_t DR3;
    uint16_t  RESERVED3;
    __IO uint16_t DR4;
    uint16_t  RESERVED4;
    __IO uint16_t DR5;
    uint16_t  RESERVED5;
    __IO uint16_t DR6;
    uint16_t  RESERVED6;
    __IO uint16_t DR7;
    uint16_t  RESERVED7;
    __IO uint16_t DR8;
    uint16_t  RESERVED8;
    __IO uint16_t DR9;
    uint16_t  RESERVED9;
    __IO uint16_t DR10;
    uint16_t  RESERVED10;
    __IO uint16_t RTCCR;
    uint16_t  RESERVED11;
    __IO uint16_t CR;
    uint16_t  RESERVED12;
    __IO uint16_t CSR;
} BKP_TypeDef;

/**
* @brief CAN basic
*/
typedef struct {
    __IO uint32_t CR;         //0x00
    __IO uint32_t CMR;            //0x04
    __IO uint32_t SR;         //0x08
    __IO uint32_t IR;         //0x0c
    __IO uint32_t ACR;            //0x10
    __IO uint32_t AMR;            //0x14
    __IO uint32_t BTR0;       //0x18
    __IO uint32_t BTR1;       //0x1C
    __IO uint32_t  RESERVED0; //0x20
    uint32_t RESERVED1;       //0x24
    __IO uint32_t TXID0;      //0x28
    __IO uint32_t TXID1;      //0x2c
    __IO uint32_t TXDR0;      //0x30
    __IO uint32_t TXDR1;      //0x34
    __IO uint32_t TXDR2;      //0x38
    __IO uint32_t TXDR3;      //0x3c
    __IO uint32_t TXDR4;      //0x40
    __IO uint32_t TXDR5;      //0x44
    __IO uint32_t TXDR6;      //0x48
    __IO uint32_t TXDR7;      //0x4c
    __IO uint32_t RXID0;      //0x50
    __IO uint32_t RXID1;      //0x54
    __IO uint32_t RXDR0;      //0x58
    __IO uint32_t RXDR1;      //0x5C
    __IO uint32_t RXDR2;      //0x60
    __IO uint32_t RXDR3;
    __IO uint32_t RXDR4;
    __IO uint32_t RXDR5;      //0x6c
    __IO uint32_t RXDR6;      //0x70
    __IO uint32_t RXDR7;      //0x74
    uint32_t RESERVED2;
    __IO uint32_t CDR;            //0x7c
} CAN_TypeDef;

/**
* @brief CAN Peli
*/
typedef struct {
    __IO uint32_t MOD;
    __IO uint32_t CMR;
    __IO uint32_t SR;
    __IO uint32_t IR;
    __IO uint32_t IER;        //0x10h
    uint32_t RESERVED0;
    __IO uint32_t BTR0;
    __IO uint32_t BTR1;
    uint32_t RESERVED1;   //0x20h
    uint32_t RESERVED2;
    uint32_t RESERVED3;
    __IO uint32_t ALC;
    __IO uint32_t ECC;        //0x30h
    __IO uint32_t EWLR;
    __IO uint32_t RXERR;
    __IO uint32_t TXERR;
    __IO uint32_t FF;     //0x40
    __IO uint32_t ID0;
    __IO uint32_t ID1;
    __IO uint32_t DATA0;
    __IO uint32_t DATA1;  //0x50
    __IO uint32_t DATA2;
    __IO uint32_t DATA3;
    __IO uint32_t DATA4;
    __IO uint32_t DATA5;  //0x60
    __IO uint32_t DATA6;
    __IO uint32_t DATA7;
    __IO uint32_t DATA8;
    __IO uint32_t DATA9;  //0x70
    __IO uint32_t RMC;
    __IO uint32_t RBSA;
    __IO uint32_t CDR;
} CAN_Peli_TypeDef;


/**
* @brief CRC calculation unit
*/

typedef struct {
    __IO uint32_t DR;
    __IO uint8_t  IDR;
    uint8_t   RESERVED0;
    uint16_t  RESERVED1;
    __IO uint32_t CR;
} CRC_TypeDef;

/**
* @brief Digital to Analog Converter
*/

typedef struct {
    __IO uint32_t CR;
    __IO uint32_t SWTRIGR;
    __IO uint32_t DHR12R1;
    __IO uint32_t DHR12L1;
    __IO uint32_t DHR8R1;
    __IO uint32_t DHR12R2;
    __IO uint32_t DHR12L2;
    __IO uint32_t DHR8R2;
    __IO uint32_t DHR12RD;
    __IO uint32_t DHR12LD;
    __IO uint32_t DHR8RD;
    __IO uint32_t DOR1;
    __IO uint32_t DOR2;
} DAC_TypeDef;


/**
* @brief Debug MCU
*/

typedef struct {
    __IO uint32_t IDCODE;
    __IO uint32_t CR;
} DBGMCU_TypeDef;

/**
* @brief DMA Controller
*/

typedef struct {
    __IO uint32_t CCR;
    __IO uint32_t CNDTR;
    __IO uint32_t CPAR;
    __IO uint32_t CMAR;
} DMA_Channel_TypeDef;

typedef struct {
    __IO uint32_t ISR;
    __IO uint32_t IFCR;
} DMA_TypeDef;

/**
* @brief External Interrupt/Event Controller
*/

